# CREATE

- Create in CRUD is synonums to SQL INSERT statement
- SQL INSERT statement is used to add new records or rows of data into a database table
- allows you to specify the values to be inserted into each column of the table for the new record
- INSERT statement is a key component of the "Create" (C) operation in the CRUD (Create, Read, Update, Delete) paradigm
- https://sqlite.org/lang_insert.html
- basic syntax of the SQL INSERT statement is as follows:

```sql
INSERT INTO table_name (column1, column2, column3, ...)
VALUES (value1, value2, value3, ...);
```

- Example:

```sql
INSERT INTO Employees (EmployeeID, FirstName, LastName, Department)
VALUES (101, 'John', 'Doe', 'Marketing');
```

- this SQL statement would insert a new record into the "Employees" table with the specified values for each column
- if the table has columns with default values, you might not need to provide a value for those columns in the INSERT statement
- if the table has an auto-incrementing primary key, you generally don't need to provide a value for that column, as the database system will automatically generate it

## Use DBeaver GUI to run insert statements

- connect chinook.db and run the collowing sql statement

```db
INSERT INTO artists (name)
VALUES('Bud Powell');
```
- because the ArtistId column is an auto-increment column, you can ignore it in the statement.


### Insert multiple rows into a table

```sql
INSERT INTO table_name (column1, column2 ,..)
VALUES 
   (value1,value2 ,...),
   (value1,value2 ,...),
    ...
   (value1,value2 ,...);
```
- each row of values represent one record or entity

```sql
INSERT INTO artists (name)
VALUES
	("Buddy Rich"),
	("Candido"),
	("Charlie Byrd");
```

### Insert default values

```sql
INSERT INTO artists DEFAULT VALUES;
```

## Use Python to insert records
- use parameterized query replacing value with ?
- provide data as a tuple
- Tuple represents one row

In [1]:
from python import db

In [2]:
help(db)

Help on module python.db in python:

NAME
    python.db

FUNCTIONS
    close_connection(conn: sqlite3.Connection)
        Close a database connection to a SQLite database.
        Args:
          conn (Connection): Connection object

    create_connection(db_file: str)
        Create a database connection to a SQLite database.
        Args:
          db_file (str): database file
        Return:
          Connection object or None

    create_table(db_file: str, create_table_sql: str)
        Create a table from the create_table_sql statement
        Args:
          db_file (str): database file path
          create_table_sql (str): a CREATE TABLE statement

    insert_many_rows(db_file: str, insert_rows_sql: str, rows: list[tuple])
        Insert data into a table from the insert_data_sql statement
        Args:
          db_file (str): database file path
          insert_data_sql (str): an INSERT INTO statement
          rows (list[tuple]): list of tuples as rows to be inserted

    insert_one_row(db_file: str, insert_row_sql: str, row: tuple)
        Insert data into a table from the insert_data_sql statement
        Args:
          db_file (str): database file path
          insert_data_sql (str): an INSERT INTO statement
          row (tuple): row as tuple to be inserted

FILE
    /Users/rbasnet/projects/Intro-Database/python/db.py

In [3]:
db_file = 'data/chinook.sqlite'

In [4]:
sql = "INSERT INTO artists (name) VALUES (?);"
# must provide data as a Python tuple and there must be an extra comma if there's only one value
row = ('Jake Powell',)

In [5]:
len(row)

1

In [6]:
db.insert_one_row(db_file, sql, row)

In [7]:
sql = 'INSERT INTO artists DEFAULT VALUES;'
db.insert_one_row(db_file, sql, ())

In [8]:
sql = """INSERT INTO artists (name)
        VALUES
        ("Buddy Rich"),
        ("Candido"),
        ("Charlie Byrd");
    """

In [9]:
sql

'INSERT INTO artists (name)\n        VALUES\n        ("Buddy Rich"),\n        ("Candido"),\n        ("Charlie Byrd");\n    '

In [10]:
# SQL will remove extra white spaces
# we need to call insert_one_row in this case because it's a single SQL statement
db.insert_one_row(db_file, sql, ())

In [11]:
# if we use parameterized query, we need to use insert_many_rows
sql = """INSERT INTO artists (name) VALUES (?)"""
data = [('Night Byrd',), ('Shin Lim',), ('Maya',)]

In [12]:
db.insert_many_rows(db_file, sql, data)
# check the artists table's data contents

## Exercise

1. Add several playlists records to chinook db's playlists table
    - Add one playlist at a time
    - Add mulitple playlists at once
    
    
2. Add several album records to chinook db's albums table
    - Add one album at at a time
    - Add multiple albums at once